In [2]:
import numpy as np
import pandas as pd

In [4]:
data = pd.read_csv("datas_animaux.csv", sep=";", header=0)

In [5]:
data.head(5)

,age_upon_outcome,animal_id,animal_type,breed,color,date_of_birth,datetime,monthyear,name,outcome_subtype,outcome_type,sex_upon_outcome
0,2 weeks,A684346,Cat,Domestic Shorthair Mix,Orange Tabby,2014-07-07T00:00:00,2014-07-22T16:04:00,2014-07-22T16:04:00,NaN,Partner,Transfer,Intact Male
1,1 year,A666430,Dog,Beagle Mix,White/Brown,2012-11-06T00:00:00,2013-11-07T11:47:00,2013-11-07T11:47:00,Lucy,Partner,Transfer,Spayed Female
2,1 year,A675708,Dog,Pit Bull,Blue/White,2013-03-31T00:00:00,2014-06-03T14:20:00,2014-06-03T14:20:00,*Johnny,NaN,Adoption,Neutered Male
3,9 years,A680386,Dog,Miniature Schnauzer Mix,White,2005-06-02T00:00:00,2014-06-15T15:50:00,2014-06-15T15:50:00,Monday,Partner,Transfer,Neutered Male
4,5 months,A683115,Other,Bat Mix,Brown,2014-01-07T00:00:00,2014-07-07T14:04:00,2014-07-07T14:04:00,NaN,Rabies Risk,Euthanasia,Unknown

In [6]:
df1 = pd.DataFrame(data['breed'].value_counts().reset_index())
df1.columns = ['breed', 'values']

In [7]:
df2 = pd.DataFrame(data['animal_type'].value_counts().reset_index())
df2.columns = ['animal_type','values']

In [8]:
df3 = pd.DataFrame(data['outcome_type'].value_counts().reset_index())
df3.columns = ['outcome_type','values']

In [9]:
print(type(df1))
df3

<class 'pandas.core.frame.DataFrame'>

      outcome_type  values
0         Adoption   33112
1         Transfer   23499
2  Return to Owner   14354
3       Euthanasia    6080
4             Died     680
5         Disposal     307
6        Rto-Adopt     150
7          Missing      46
8         Relocate      16

In [40]:
df1.to_csv("breed.csv", index=False)
df2.to_csv("animal_type.csv", index=False)
df3.to_csv("outcome.csv", index=False)

In [13]:
df4 = data.groupby(['outcome_type','animal_type']).agg({'animal_id' : 'count'}).reset_index()
df4

       outcome_type animal_type  animal_id
0          Adoption        Bird        114
1          Adoption         Cat      12732
2          Adoption         Dog      20052
3          Adoption   Livestock          2
4          Adoption       Other        212
5              Died        Bird          4
6              Died         Cat        403
7              Died         Dog        138
8              Died       Other        135
9          Disposal        Bird         22
10         Disposal         Cat         16
11         Disposal         Dog         17
12         Disposal       Other        252
13       Euthanasia        Bird         85
14       Euthanasia         Cat       1453
15       Euthanasia         Dog       1504
16       Euthanasia       Other       3038
17          Missing        Bird          1
18          Missing         Cat         28
19          Missing         Dog         17
20         Relocate        Bird          7
21         Relocate       Other          9
22  Return to Owner        Bird          9
23  Return to Owner         Cat       1431
24  Return to Owner         Dog      12875
25  Return to Owner   Livestock          1
26  Return to Owner       Other         38
27        Rto-Adopt         Cat         33
28        Rto-Adopt         Dog        117
29         Transfer        Bird         92
30         Transfer         Cat      13323
31         Transfer         Dog       9518
32         Transfer   Livestock          6
33         Transfer       Other        560

In [14]:
df4.to_csv("animal_count.csv", index=False)